[
    {
        "name": "Baris",
        "title": "IT Engineer",
        "text": "I have been studying with Filip for a while now. We are reading Hegel's Phenomenology where I write short essays and receive detailed feedback. Filip is patient, knowledgeable, and smart among many other positive traits. One of his most helpful approaches is to let me attempt my interpretation before he gives his, that way I have a shot at pushing my understanding and then see where I failed, which is invaluable. It is fascinating when Filip provides deeper insights rooted in his intimate knowledge of Hegel's corpus. With Filip's help, I will be more comfortable reading the Phenomenology in the future with this approach as I can always anchor myself confidently in the text at some level.",
        "img_url": "/static/images/people/baris.webp"
    },
    {
        "name": "Camillo Coccia",
        "title": "Medical Doctor",
        "text": "Filip has been a mentor for me for the last few years. His ability to make difficult philosophical texts coherent to people with vastly different backgrounds is the socratic spirit of philosophy. The Science of Logic course was the best structured and most comprehensive course I had ever attended, including courses at university.",
        "url": "https://x.com/camillococcia?s=09",
        "img_url": "/static/images/people/camillo.webp"
    },
    {
        "name": "Lennart Oberlies",
        "title": "Architect",
        "text": "Filip lays the strongest evidence himself for a philosophical life. On entering dialogues and discussions with us students, he attends with everything he impersonates to the real challenge of teaching: letting you find ways to bring something up and forward, to raise a subject or a problem yourself, to broach a topic which may live latent in you. This makes his teaching so really unique in my opinion: he addresses and opens the group for conversing, with careful attention to the specificity of every singular voice.",
        "img_url": "/static/images/people/lennart.webp"
    },
    {
        "name": "Drew Lockwood",
        "title": "Jiu Jitsu Instructor",
        "text": "Amazing course! I did private lessons with Filip, worth every penny! The 'What is Philosophy' course helped kick off my latest creative project. Highly recommend it to anyone interested in philosophy.",
        "url": "https://riliongraciewesthouston.com/",
        "img_url": "/static/images/people/drew.webp"
    },
    {
        "name": "Stee",
        "title": "Musician",
        "text": "My philosophical studies received a jet fuel injection with Filip's teaching. The 'What is Philosophy?' course was beautifully engineered using Collingwood as an anchor text to visit upon several blockbuster philosophical works. Along with weekly videos and materials that brought the themes into sharp focus. Filip allowed us to unpack our thoughts in the seminars and learn at our own pace, guiding us wisely through the seminar discussions and nudging us on our blind spots. I thoroughly enjoyed it and I look forward to seeing my course-mates on another one soon.",
        "img_url": "/static/images/people/stee.webp"
    },
    {
        "name": "Michael Patton",
        "title": "Principal Architect",
        "text": "Filip's teaching style embraces the rigor of a Hegelian scholarship with a patient approach that guides us through complex yet transformative insights. I've taken many of Filip's courses; each is immersive, allowing new perspectives to understand the text.",
        "url": "https://www.linkedin.com/in/pattonmichael/",
        "img_url": "/static/images/people/michael.webp"
    }
]
